---
kind: type
id: T:Autodesk.Revit.DB.PaperSizeSetIterator
source: html/467222b2-e681-2921-0c23-0bf0456b5675.htm
---
# Autodesk.Revit.DB.PaperSizeSetIterator

An iterator to a set of paper size objects.

## Syntax (C#)
```csharp
public abstract class PaperSizeSetIterator : APIObject,
	IEnumerator
```